Revit 2024 API
ElementIdParameterValue Constructor (ElementId)
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public ElementIdParameterValue(
	ElementId value
)
Visual Basic
Public Sub New ( _
	value As ElementId _
)
Visual C++
public:
ElementIdParameterValue(
	ElementId^ value
)
Parameters
value
Type: Autodesk.Revit.DB.ElementId
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ElementIdParameterValue Class
ElementIdParameterValue Overload
Autodesk.Revit.DB Namespace